Documents/ВыездНаЗамер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ВыездНаЗамер</Name>
			<BasedOn>
				<xr:Item>Document.ЗаявкаНаЗамер</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыездаПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыездаФакт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплатаИсполнителю</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаЗамер</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СокращенноеНазвание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ГабаритныеЧертежи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГабаритныйЧертеж</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГабаритныеЧертежи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗамерПроизведен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Помещение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Исполнители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Исполнитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПричинаИзменени</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПредыдущая</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаИзменения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ДокументыДляВыезда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДокументыДляВыезда</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыезда</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документы</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаЗамер</v8:Type>
						<v8:Type>cfg:DocumentRef.ОзнакомительныйВыезд</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыездНаЗамер</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ОбъектыЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ОбъектыЗадач</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВедущийКонструктор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнитьКартуПроектаДиз</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнитьКартуПроектаКон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаполнениеДлительностиПроизводства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаполненияДлительностиМонтажа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодготовитьОзнакомительныйВыезд</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроверятьГабаритныеЧерчежи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РуководительЗамера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоздатьЗапускВРаботу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоздатьКартуПроектаДиз</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоздатьКартуПроектаКон</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаявкаНаЗамер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаявкаНаЗамер</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыездаПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОжидаемыйСтатусЗамера</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗамера</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СокращенноеНазвание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Помещения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Помещение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПричинаИзменени</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПредыдущая</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаИзменения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/ГабаритныеЧертежи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ГабаритныеЧертежи</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дизайнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МодельГотоваАвтор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МодельГотоваДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Помещения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Помещение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/НазначениеАвтораДляЗадачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>НазначениеАвтораДляЗадачи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектЗадачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОбъектыЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продолжительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сортировка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ВыездНаЗамер/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если НЕ ЗначениеЗаполнено(Номер) Тогда
		Префикс = Проект.Префикс + "-";
		УстановитьНовыйНомер(Префикс); 
	КонецЕсли;
	
	СокращенноеНазвание = омЗаполнениеРеквизиов.ПолучитьСокращенноеНазвание(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаНаЗамер") Тогда

		Если НЕ ДанныеЗаполнения.Проведен Тогда
		
			Сообщить("Нельзя создавать Выезд на замер пна основании не проведенной заявки");
			СтандартнаяОбработка = Ложь;
			Возврат;
		
		КонецЕсли; 
		
		Основание 		= ДанныеЗаполнения.Ссылка;
		Проект 			= ДанныеЗаполнения.Проект;
		Автор 			= ПараметрыСеанса.ТекущийПользователь; 
		ДатаВыездаПлан 	= ДанныеЗаполнения.ДатаВыездаПлан;
			
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Помещения.Ссылка КАК Помещение,
			|	ГабаритныеЧертежиПомещения.Ссылка КАК ГабаритныйЧертеж
			|ИЗ
			|	Справочник.Помещения КАК Помещения
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГабаритныеЧертежи.Помещения КАК ГабаритныеЧертежиПомещения
			|		ПО (ГабаритныеЧертежиПомещения.Помещение = Помещения.Ссылка)
			|ГДЕ
			|	Помещения.Ссылка В(&Ссылка)
			|
			|СГРУППИРОВАТЬ ПО
			|	ГабаритныеЧертежиПомещения.Ссылка,
			|	Помещения.Ссылка
			|
			|УПОРЯДОЧИТЬ ПО
			|	Помещения.Наименование,
			|	ГабаритныеЧертежиПомещения.Ссылка.Наименование";
		
		Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения.Помещения.ВыгрузитьКолонку("Помещение"));
		
		ГабаритныеЧертежи.Загрузить(Запрос.Выполнить().Выгрузить());
	
	КонецЕсли;
	
КонецПроцедуры

Процедура СоздатьЗадачуПроверки(Выборка, Исполнитель)
	
	ЗадачаПроверки = Задачи.ПроверитьГабаритныеЧертежи.СоздатьЗадачу();
	ЗадачаПроверки.Дата 					= ТекущаяДата();
	ЗадачаПроверки.Основание 				= Ссылка;
	ЗадачаПроверки.ГабаритныйЧертеж 		= Выборка.ГабаритныйЧертеж;
	ЗадачаПроверки.Исполнитель 				= Исполнитель;
	ЗадачаПроверки.Наименование				= Выборка.ГабаритныйЧертежНаименование + ".Проверка";	
	ЗадачаПроверки.Проект					= Выборка.Проект;	
	ЗадачаПроверки.КрайняяДатаИсполнения	= ЗадачаПроверки.Дата + 7 * 24 * 3600;	
	ЗадачаПроверки.БылаКорректировка		= 0;	
	
	ЗадачаПроверки.Записать();

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВыездНаЗамерГабаритныеЧертежи.ГабаритныйЧертеж КАК ГабаритныйЧертеж,
		|	ВыездНаЗамерГабаритныеЧертежи.ГабаритныйЧертеж.Наименование КАК ГабаритныйЧертежНаименование,
		|	ВыездНаЗамерГабаритныеЧертежи.ГабаритныйЧертеж.Проект КАК Проект
		|ИЗ
		|	Документ.ВыездНаЗамер.ГабаритныеЧертежи КАК ВыездНаЗамерГабаритныеЧертежи
		|		ЛЕВОЕ СОЕДИНЕНИЕ Задача.ПроверитьГабаритныеЧертежи КАК ПроверитьГабаритныеЧертежи
		|		ПО (ВыездНаЗамерГабаритныеЧертежи.Ссылка = (ВЫРАЗИТЬ(ПроверитьГабаритныеЧертежи.Основание КАК Документ.ВыездНаЗамер)))
		|			И ВыездНаЗамерГабаритныеЧертежи.ГабаритныйЧертеж = ПроверитьГабаритныеЧертежи.ГабаритныйЧертеж
		|ГДЕ
		|	ВыездНаЗамерГабаритныеЧертежи.Ссылка В(&Ссылка)
		|	И ВыездНаЗамерГабаритныеЧертежи.ЗамерПроизведен
		|	И ПроверитьГабаритныеЧертежи.Ссылка ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	ВыездНаЗамерГабаритныеЧертежи.ГабаритныйЧертеж,
		|	ВыездНаЗамерГабаритныеЧертежи.ГабаритныйЧертеж.Наименование,
		|	ВыездНаЗамерГабаритныеЧертежи.ГабаритныйЧертеж.Проект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НазначениеАвтораДляЗадачи.Исполнитель КАК Исполнитель
		|ИЗ
		|	Справочник.НазначениеАвтораДляЗадачи КАК НазначениеАвтораДляЗадачи
		|ГДЕ
		|	НазначениеАвтораДляЗадачи.ОбъектЗадачи = ЗНАЧЕНИЕ(Перечисление.ОбъектыЗадач.ПроверятьГабаритныеЧерчежи)";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.ВыполнитьПакет(); 
	
	Исполнитель = Неопределено;
	Выборка = Результат[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		Исполнитель = Выборка.Исполнитель;
	КонецЦикла;
	
	
	Выборка = Результат[0].Выбрать();
	Пока Выборка.Следующий() Цикл
		СоздатьЗадачуПроверки(Выборка, Исполнитель);
	КонецЦикла; 
	
	ДокументыВыездНаЗамер();
	
КонецПроцедуры

Процедура ДокументыВыездНаЗамер()

	мДокументы = Новый Массив(2);
	мДокументы[0] = Ссылка;
	мДокументы[1] = Основание;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокументыДляВыезда.Документы КАК Документ
		|ИЗ
		|	РегистрСведений.ДокументыДляВыезда КАК ДокументыДляВыезда
		|ГДЕ
		|	ДокументыДляВыезда.Документы В(&Документы)";
	
	Запрос.УстановитьПараметр("Документы", мДокументы);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ЕстьВРегистреСсылка 	= Ложь;
	ЕстьВРегистреОснование 	= Ложь;
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.Документ = Ссылка Тогда
			ЕстьВРегистреСсылка = Истина;
		Иначе
			ЕстьВРегистреОснование 	= Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьВРегистреОснование Тогда
	
		НаборЗаписей = РегистрыСведений.ДокументыДляВыезда.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Документы.Установить(Основание);
			
		НаборЗаписей.Записать();
		
	КонецЕсли;
	
	Если ЕстьВРегистреСсылка И ЗначениеЗаполнено(ДатаВыездаФакт) Тогда
	
		НаборЗаписей = РегистрыСведений.ДокументыДляВыезда.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Документы.Установить(Ссылка);
			
		НаборЗаписей.Записать();
		
	ИначеЕсли НЕ ЗначениеЗаполнено(ДатаВыездаФакт) Тогда
	
		МенеджерЗаписей = РегистрыСведений.ДокументыДляВыезда.СоздатьМенеджерЗаписи();
		МенеджерЗаписей.Документы 		= Ссылка;
		МенеджерЗаписей.Исполнитель		= Исполнитель;
		МенеджерЗаписей.ДатаВыезда 		= ДатаВыездаПлан;
		МенеджерЗаписей.ДатаСоздания 	= Дата;
		
	    МенеджерЗаписей.Записать(); 
		
		Для каждого х Из Исполнители Цикл
			
			МенеджерЗаписей = РегистрыСведений.ДокументыДляВыезда.СоздатьМенеджерЗаписи();
			МенеджерЗаписей.Документы 		= Ссылка;
			МенеджерЗаписей.Исполнитель		= х.Исполнитель;
			МенеджерЗаписей.ДатаВыезда 		= ДатаВыездаПлан;
			МенеджерЗаписей.ДатаСоздания 	= Дата;
			
			МенеджерЗаписей.Записать(); 
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Если ЗначениеЗаполнено(Основание) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЗаявкаНаЗамер.ДатаВыездаПлан КАК ДатаВыездаПлан,
			|	ЗаявкаНаЗамер.Дата КАК Дата,
			|	ЗаявкаНаЗамер.Проведен КАК Проведен
			|ИЗ
			|	Документ.ЗаявкаНаЗамер КАК ЗаявкаНаЗамер
			|ГДЕ
			|	ЗаявкаНаЗамер.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Основание);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Если ЗначениеЗаполнено(Выборка.Проведен) Тогда
				
				МенеджерЗаписей = РегистрыСведений.ДокументыДляВыезда.СоздатьМенеджерЗаписи();
				МенеджерЗаписей.Документы 		= Основание; 
				МенеджерЗаписей.ДатаВыезда 		= Выборка.ДатаВыездаПлан;
				МенеджерЗаписей.ДатаСоздания 	= Выборка.Дата;
				
				МенеджерЗаписей.Записать();
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли; 
	
	НаборЗаписей = РегистрыСведений.ДокументыДляВыезда.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Документы.Установить(Ссылка);
	
	НаборЗаписей.Записать();
		
 
КонецПроцедуры
